<?php
// Heading
$_['heading_title']            = 'Playful Sparkle - مرشح المنتج إلى الفئة';
$_['heading_getting_started']  = 'ابدأ';
$_['heading_setup']            = 'إعداد مرشح المنتج إلى الفئة Playful Sparkle';
$_['heading_troubleshot']      = 'استكشاف الأخطاء وإصلاحها الشائعة';
$_['heading_contact']          = 'اتصل بالدعم';

// Text
$_['text_extension']           = 'الإضافات';
$_['text_success']             = 'نجاح: لقد قمت بتعديل وحدة مرشح المنتج إلى الفئة!';
$_['text_filter_success']      = 'نجاح: تمت إزالة المرشحات غير المستخدمة بنجاح!';
$_['text_edit']                = 'تحرير وحدة مرشح المنتج إلى الفئة';
$_['text_getting_started']     = '<p><strong>نظرة عامة:</strong> يعمل امتداد Playful Sparkle - مرشح المنتج إلى الفئة على تحسين متجر OpenCart 4.x الخاص بك عن طريق تبسيط إدارة المرشحات داخل الفئات. عند حفظ معلومات المنتج، يقوم هذا الامتداد تلقائيًا بربط مرشحات المنتج المرتبطة بالفئات ذات الصلة، مما يوفر الوقت ويضمن الاتساق عبر إعداد المرشحات الخاص بك.</p><p><strong>المتطلبات:</strong> OpenCart 4.x+، يجب تثبيت PHP 7.4+ وتكوينه بشكل صحيح.</p>';
$_['text_setup']               = '<p>لإعداد الامتداد، قم بتثبيته وتمكينه من خلال لوحة إدارة OpenCart. انتقل إلى الإضافات > الوحدات، وحدد موقع Playful Sparkle - مرشح المنتج إلى الفئة، وانقر فوق زر التمكين.</p>';
$_['text_troubleshot']         = '<ul><li><strong>لا يمكن رؤية زر إزالة المرشحات غير المستخدمة:</strong> تأكد من تمكين الامتداد أو تسجيل معالجات الأحداث. انقر فوق زر إصلاح معالج الأحداث لإعادة التسجيل.</li><li><strong>لم تتم إضافة المرشحات إلى الفئة:</strong> تأكد من تمكين الامتداد أو تسجيل معالجات الأحداث. انقر فوق زر إصلاح معالج الأحداث لإعادة التسجيل.</li><li><strong>لا يمكن رؤية المرشحات في الصفحة الرئيسية</strong> يجب عليك تمكين وحدة المرشح وتعيينها لتصميم.</li></ul>';
$_['text_contact']             = '<p>للحصول على مزيد من المساعدة، يرجى التواصل مع فريق الدعم لدينا:</p><ul><li><strong>الاتصال:</strong> <a href="mailto:%s">%s</a></li><li><strong>التوثيق:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">توثيق المستخدم</a></li></ul>';

// Tab
$_['tab_general']              = 'عام';
$_['tab_help_and_support']     = 'المساعدة والدعم';

// Entry
$_['entry_status']             = 'الحالة';

// Button
$_['button_remove_filter']     = 'إزالة المرشحات غير المستخدمة';

// Error
$_['error_permission']         = 'تحذير: ليس لديك صلاحية تعديل وحدة مرشح المنتج إلى الفئة!';
