<?php
// Heading
$_['heading_title']            = 'Playful Sparkle - Φίλτρο Προϊόντων σε Κατηγορίες';
$_['heading_getting_started']  = 'Ξεκινώντας';
$_['heading_setup']            = 'Ρύθμιση Φίλτρου Προϊόντων σε Κατηγορίες';
$_['heading_troubleshot']      = 'Συνηθισμένη Αντιμετώπιση Προβλημάτων';
$_['heading_contact']          = 'Επικοινωνία με την Υποστήριξη';

// Text
$_['text_extension']           = 'Επεκτάσεις';
$_['text_success']             = 'Επιτυχία: Τροποποιήσατε το module φίλτρου Προϊόντων σε Κατηγορίες!';
$_['text_filter_success']      = 'Επιτυχία: Τα αχρησιμοποίητα φίλτρα αφαιρέθηκαν επιτυχώς!';
$_['text_edit']                = 'Επεξεργασία Module Φίλτρου Προϊόντων σε Κατηγορίες';
$_['text_getting_started']     = '<p><strong>Επισκόπηση:</strong> Η επέκταση Playful Sparkle - Φίλτρο Προϊόντων σε Κατηγορίες βελτιώνει το OpenCart 4.x κατάστημά σας απλοποιώντας τη διαχείριση φίλτρων εντός των κατηγοριών. Κατά την αποθήκευση των πληροφοριών προϊόντος, αυτή η επέκταση συνδέει αυτόματα τα σχετικά φίλτρα προϊόντων με τις αντίστοιχες κατηγορίες, εξοικονομώντας χρόνο και διασφαλίζοντας συνέπεια στη ρύθμιση των φίλτρων σας.</p><p><strong>Απαιτήσεις:</strong> OpenCart 4.x+, PHP 7.4+ πρέπει να είναι εγκατεστημένα και σωστά ρυθμισμένα.</p>';
$_['text_setup']               = '<p>Για να ρυθμίσετε την επέκταση, εγκαταστήστε και ενεργοποιήστε την μέσω του πίνακα διαχείρισης του OpenCart. Μεταβείτε στην ενότητα Επεκτάσεις > Modules, εντοπίστε το Playful Sparkle - Φίλτρο Προϊόντων σε Κατηγορίες και κάντε κλικ στο κουμπί Ενεργοποίηση.</p>';
$_['text_troubleshot']         = '<ul><li><strong>Δεν βλέπετε το κουμπί "Αφαίρεση αχρησιμοποίητων φίλτρων":</strong> Βεβαιωθείτε ότι η επέκταση είναι ενεργοποιημένη ή ότι οι χειριστές συμβάντων (event handlers) είναι καταχωρημένοι. Κάντε κλικ στο κουμπί "Διόρθωση Χειριστή Συμβάντων" για να τους καταχωρήσετε ξανά.</li><li><strong>Τα φίλτρα δεν προστίθενται στην κατηγορία:</strong> Βεβαιωθείτε ότι η επέκταση είναι ενεργοποιημένη ή ότι οι χειριστές συμβάντων (event handlers) είναι καταχωρημένοι. Κάντε κλικ στο κουμπί "Διόρθωση Χειριστή Συμβάντων" για να τους καταχωρήσετε ξανά.</li><li><strong>Δεν βλέπετε φίλτρα στην αρχική σελίδα</strong> Πρέπει να ενεργοποιήσετε το module φίλτρων και να το αντιστοιχίσετε σε μια διάταξη (layout).</li></ul>';
$_['text_contact']             = '<p>Για περαιτέρω βοήθεια, επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Εγχειρίδιο Χρήστη</a></li></ul>';

// Tab
$_['tab_general']              = 'Γενικά';
$_['tab_help_and_support']     = 'Βοήθεια &amp; Υποστήριξη';

// Entry
$_['entry_status']             = 'Κατάσταση';

// Button
$_['button_remove_filter']     = 'Αφαίρεση αχρησιμοποίητων φίλτρων';

// Error
$_['error_permission']         = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε το module φίλτρου Προϊόντων σε Κατηγορίες!';
